//icons
import { IoMdArrowDropdown } from "react-icons/io";

//images
import image1 from "../assets/slidercar/1.webp";
import image2 from "../assets/slidercar/2.webp";
import image3 from "../assets/slidercar/3.webp";
import image4 from "../assets/slidercar/4.webp";
import image5 from "../assets/slidercar/5.webp";

import logocar1 from "../assets/logocars/11.webp";
import logocar2 from "../assets/logocars/22.webp";
import logocar3 from "../assets/logocars/33.webp";
import logocar4 from "../assets/logocars/44.webp";

import articlse1 from "../assets/articles/5.webp";
import articlse2 from "../assets/articles/3.webp";
import articlse3 from "../assets/articles/1.webp";
import articlse4 from "../assets/articles/6.webp";
import articlse5 from "../assets/articles/7.webp";
import articlse6 from "../assets/articles/8.webp";
import articlse7 from "../assets/articles/11.webp";
import articlse8 from "../assets/articles/12.webp";
import articlse9 from "../assets/articles/13.webp";

import cars1 from "../assets/galleryCar/1.webp";
import cars2 from "../assets/galleryCar/2.webp";
import cars3 from "../assets/galleryCar/3.webp";
import cars4 from "../assets/galleryCar/4.webp";
import cars5 from "../assets/galleryCar/5.webp";
import cars6 from "../assets/galleryCar/6.webp";
import cars7 from "../assets/galleryCar/7.webp";
import cars8 from "../assets/galleryCar/8.webp";
import cars9 from "../assets/galleryCar/9.webp";
import cars10 from "../assets/galleryCar/10.webp";
import cars11 from "../assets/galleryCar/11.webp";
import cars12 from "../assets/galleryCar/12.webp";

export const headerMenu = [
  { id: 1, title: "صفحه اصلی", paths: "/" },
  { id: 2, title: "خدمات", paths: "/", icon: <IoMdArrowDropdown /> },

  {
    id: 3,
    title: "مقالات",
    paths: "/articles",
  },
  {
    id: 4,
    title: "تماس با ما",
    paths: "/contact-us",
  },
  {
    id: 5,
    title: "درباره ما",
    paths: "/about",
    icon: <IoMdArrowDropdown size={30} />,
  },
  {
    id: 6,
    title: "مسیریابی",
    paths: "/about",
    paths: "/google",
  },
];

export const sliderImage = [
  { id: 1, image: image1 },
  { id: 2, image: image2 },
  { id: 3, image: image3 },
  { id: 4, image: image4 },
  { id: 5, image: image5 },
];

export const logocars = [
  { id: 1, image: logocar1 },
  { id: 2, image: logocar2 },
  { id: 3, image: logocar3 },
  { id: 4, image: logocar4 },
];

export const articlesData = [
  {
    id: 1,
    imgae: articlse1,
    title: "دیفرانسیل خودرو",
    li: "دیفرانسیل خودرو وسیله ای است که گشتاور از موتور را به دو قسمت تقسیم می کند تا هر قسمت به صورت مجزا چرحی را به گردش در آورد.وقتی یک خودرو دور میزند چرخ های آن با  سرعت های متفاوتی می چرخند.چرخهایی که به  سمت داخل پیچ هستند مسافت کمتری نسبت به چرخ هایی که سمت خارج پیچ هستند طی میکنند.اگر اتوموبیل دیفرانسیل نداشته باشد چرخ ها به یکدیگر قفل می شوند و با سرعت یکسانی می چرخند و چرخش اتوموبیل با دشواری مواجه میشود",
    li2: "در این صورت یکی از چرخ ها باید در جای خود بلغزد.که می دانیم برای این کار نیروی زیادی لازم است.این نیرو از طریق اکسل از یک چرخ به چرخ دیگر منتقل می شود و فشار زیادی بر اجزای اکسل وارد میکتد.",

    li3: "1.نیروی موتور را تغیر جهت داده و به چرخ های می رساند",

    li4: "2.بعنوان آخرین مرحله تغییر دور و گشتاور عمل کرده و دور را کاهش می دهد.",

    li5: "نیرو را به شکلی به چرخ ها می رساند که هر کدام بتوانند با سرعتهای متفاوت بچرخند . دیفرانسیل از ۶ قسمت تشکیل شده است که عبارتند از: هوزینگ، واشر مسی، دنده پلوس، هرزگرد، پینیون و کرانویل؛ هر کدام از این قطعات بخشی از وظایف مکانیکی دیفرانسیل را بر عهده دارند",
  },

  {
    id: 2,
    imgae: articlse2,
    title: "گیربکس خودرو",
    li: "گیربکس یکی از عامل های انتقال دهنده نیرو است. تولید کننده نیرو موتور یا پیشرانه است. انتقال دهنده هم سیستمی شکل پذیر از بخش‌های گوناگون است که عمل انتقال نیرو را در کنار هم و به صورت مداوم انجام می‌دهند. نیروی  ایجاد شده توسط پیشرانه، باید توسط یک سیستم انتقال دهنده، به چرخ‌ها منتقل شود. سه بخش اصلی این سیستم انتقال دهنده شامل کلاچ، جعبه دنده و دیفرانسیل هستند که در میان آنها جعبه دنده از  ارزش ویژه‌ای برخوردار است. جعبه‌دنده را اصطلاحا gearbox هم می‌گویند جعبه دنده اغلب گیربکس نامیده می شود. گیربکس ها به مجموعه ای از چرخ دنده ها و بدنه آن ها اشاره دارند که بیشتر در خودروها یافت می شود.",

    li2: "از آنجایی که اکثر موتورهای وسایل نقلیه موتوری دارای سرعت های عملیاتی و دور آرام بالایی هستند، گیربکس ها به ماشین ها اجازه می دهند تا به طور موثر کار کنند و حتی به کند کردن و خاموش کردن ماشین ها کمک می کنند.",

    li3: "مکانیزم دوم ویژه گیربکس اتومات است. دسته دوم از انواع جعبه دنده ها که با توجه به علم روز توسعه  کرده و رفته رفته جانشین جعبه دنده های دنده ای می شوند، همین گیربکس های دنده اتومات هستند. ساختمان اصلی گیربکس اتومات مشابه گیربکس های دستی است. ولی یک  فرق بزرگ با سیستم های دستی دارند که آن هم حذف کلاج و نقش انسانی از سیستم دنده دهی در هنگام رانندگی است.",
  },
  {
    id: 3,
    imgae: articlse3,
    title: " موتور خودرو",
    li: "موتور خودرو یکی از اجزای مهم حیاتی آن است که برای عملکرد صحیح خودرو لازم است. در واقع موتور خودرو قلب خودرو است که وظیفه تبدیل سوخت به انرژی مکانیکی برای تامین انرژی خودرو را بر عهده دارد.",

    li2: "در موتورهای بنزینی, سوخت با هوا در سیلندر ترکیب شده و با ترکیب این مخلوط با اکسیژن هوا با اکسیژن هوا باعث ایجاد یک انفجار کوچک می شود که این انفجار باعث حرکت پیستون به سمت پایین و سپس بالا می شود و این حرکت پیستون ها باعث چرخش کرنک شافت می شود.",

    li3: "1.موتور بنزینی:موتور بنزینی یکی از معروف ترین و پر  استفاده ترین انواع موتورهای خودرو است,این موتور با استفاده از سوخت بنزین کار میکند و در آن مخلوط سوخت هوا داخل سلندرها و در اثر اشتغال توسط جرقه شمع منجر به روشن شدن موتور خودرو شده و ان را به حرکت در میآورد",

    li4: "2-موتور دیزل:موتور دیزل یکی دیگر از انواع موتورهای خودرو است که با استفاده از سوخت دیزل کار میکند.موتورهای دیزلی از   شمع استفاده نمی کنند.درعوض از گرمای فشرده سازی برای مشتعل کردن مخلوط سوخت و هوا استفاده می کنند",
    li5: "موتور الکتریکی:موتور الکتریکی یکی از انواع موتورهایی است که با استفاده از باتری الکتریکی کار می کند. در این موتور انرژی الکتریکی برای تولید حرکت به کار میرود.",
  },

  {
    id: 4,
    imgae: articlse4,
    title: "سقف کهکشانی",
    li: "یکی از تزیینات رویایی و جدیدی که برای سقف خودروهای ایرانی و خارجی رایج شده است ، سقف کهکشانی یا سقف فیبر نوری یا سقف پرستاره خودرو است. در واقع داخل سقف خودرو نقاطی نورانی کار می شود که همزمان با هم یا به صورت مستقل از هم خاموش و روشن شده و شکل یک آسمان واقعی را تداعی می کنند.",

    li2: "سقف کهکشانی معمولا به رنگ مشکی . یا رنگ های تیره ساخته میشود",

    li3: "صحنه ای بی نظیر همچون کهکشان را به وجود می آورند",

    li4: "با این رو شما می توانید آسمانی پرستاره را در خودرو خود داشته باشید.",

    li5: "بعضی اتومبیل ها از قبیل رویس رولز و لیموزین ها به صورت خودکار این آپشن را در خود دارند.",
  },

  {
    id: 5,
    imgae: articlse5,
    title: "تعمیر چرم داخل خودرو",
    li: "یکی از مهم‌ترین اقدامات در راستای مراقبت از خودرو، مراقبت از روکش های چرمی بکار رفته در خودرو است",

    li2: "مراحل ترمیم چرم صندلی ماشین به میزان و نوع آسیب دیدگی متفاوت است اما به شکل خلاصه اینگونه فرآیند آن را شرح میدهیم:",

    li3: "چرم زدایی و چربی زدایی عمقی چرم زیر سازی قسمت آسیب دیده",

    li4: "رنگ سازی و رنگ پاشی روی سطح چرمی",
  },

  {
    id: 6,
    imgae: articlse6,
    title: "پی دی ار",
    li: "این کلمه از عبارت Paintless dent repair به معنای صافکاری بدون رنگ و یا تعمیر بدون رنگ فرورفتگی های خودرو گرفته شده است",

    li2: "PDR یک فناوری تعمیر بدنه خودرو است که برای از بین بردن فرورفتگی ها و سایر عیوب تغییر شکل روی بدنه وسیله نقلیه با حفظ رنگ اصلی استفاده می شود.",

    li3: "موارد استفاده صافکاری PDR بیشتر برای از بین بردن فرورفتگی های ناشی از طوفان و تگرگ دیده می شود. استادکاران این حرفه از میله های مخصوص، اهرم های دم ماهی، میله های مسطح، چکش، سیستم های چسب حرارتی، آداپتورها، چکش های لغزنده، چراغ های مخصوص و سایر ابزارهای حرفه ای PDR برای از بین بردن فرورفتگی ها از بدنه خودرو استفاده می کنند..",

    li4: "اولین مرحله بررسی دقیق فرورفتگی و تعیین شدت آسیب است",
    li5: "مرحله دوم فرورفتگی بدون رنگ مربوط به دسترسی به ناحیه پشت فرورفتگی است",
    li6: "مرحله سوم تخمین هزینه تعمیر فرورفتگی پنل روی وسیله نقلیه شما است.",
  },
  {
    id: 7,
    imgae: articlse7,
    title: "پولیش خودرو",
    li: "پولیش محصولی است که به صورت‌های مختلف مثل جامد، مایع و یا حالت اسپری به بازار عرضه می‌شود و از بدنه خودرو در مقابل آسیب‌هایی مثل لکه، چربی، ایجاد خط و خش و … مراقبت می‌کند",

    li2: "و پولیش همانند یک سنباده عمل می‌کند و ناخالصی‌ها را از روی رنگ خودرو پاک می‌کند تا درخشندگی آن بیشتر شود و لازم به ذکر است که این لایه برداری هیچ‌گونه تاثیر مخربیی بر روی کیفیت رنگ ماشین ندارد",

    li3: "چرا خودرو را پولیش می کنیم؟",

    li4: "_ وجود خط و خش بر روی ماشین",
    li5: "سوختگی و رنگ پریدگی خودرو در اثر تابش مستقیم آفتاب یا شوینده های نامناسب رنگ بدنه مات میشود",
    li6: "مرحله سوم تخمین هزینه تعمیر فرورفتگی پنل روی وسیله نقلیه شما است.",
  },
  {
    id: 7,
    imgae: articlse8,
    title: "سیستم پایداری",
    li: "یکی از سیستم هایی که میزان مرگ و میر ناشی از تصادفات را به طور قابل توجهی کاهش داده است سیستم کنترل پایداری در خودروها است.",

    li2: "سیستم کنترل پایداری شامل سه نوع سنسور می باشد که هرکدام بنا به موقعیت قرارگیری نقش اساسی در حفظ تعادل خودرو برعهده دارند:",

    li3: "۱- سنسور سرعت دورانی چرخ : این سنسور که به طور مجزا در هر چرخ وجود دارد و قادر است با ارسال سیگنال به کامپیوتر مرکزی فشار ترمز را به یک چرخ کاهش یا افزایش دهد.",

    li4: "۲- سنسور زاویه فرمان : این سنسور موقعیت فرمان را با اندازه گیری زاویه واقعی فرمان اندازه گیری می کند",
    li5: "۳-شخیص میزان انحراف(Yaw) : میزان انحراف خودرو حول محور عمودی را اندازه گیری می کند.",
  },
  {
    id: 7,
    imgae: articlse9,
    title: "سرامیک خودرو",
    li: "سرامیک ماشین یک نوع پوشش پلیمر مایع است که روی  بدنه ماشین کشیده میشود. این روکش شیمیایی با رنگ مایشین پیوند میخورد ولایه ای محافظتی را روی بدنه ماشین ایجاد می کند. زمانی که پوشش سرامیکی روی  بدنه ماشین اعمال میشود,پلیمر مایع رنگ بدنه ماشین یا همان رنگ کارخانه ای اتوموبیل پیوند شیمیایی ایجاد میکند",
    li2: "مزایا و معایب سرامیک خودرو:",

    li3: "مزایا و معایب سرامیک خودرو بهترین محافظ رنگ بدنه سرامیک خودرو یک پوشش را روی بدنه ماشین ایجاد می کند. که اساساً این سطح محکم و مانعی برای صدمه دیدن رنگ ماشین است. همچنین این لایه می تواند از کلیه مواردی که باعث آسیب به بدنه ماشین می شود جلوگیری کند",

    li4: "سرامیک خودرو یک لایه محافظ در برابر تمامی آسیب ها و خطراتی است",
    li5: "پوشش اولیه بدنه ماشین وقتی در معرض آب و هوا ، باران های اسیدی ، قطرات باران ، غضولات پرندگان و غیره قرار می گیرند، به مرور زمان دوام آن کاهش پیدا می کند. اما سرامیک خودرو به شرط رعایت اصول و مواد مرغوب دارای دوام بیشتری است و میتواند سال ها از بدنه ماشین محفاظت کند",
    li6: "اگر سرامیک خودرو بدست افراد باتجربه صورت نگیرد ممکن است بدتر از رنگ اصلی ماشین شود.",
  },
];

export const galleryCarts = [
  { id: 1, image: cars1 },
  { id: 2, image: cars2 },
  { id: 3, image: cars3 },
  { id: 4, image: cars4 },
  { id: 5, image: cars5 },
  { id: 6, image: cars6 },
  { id: 7, image: cars7 },
  { id: 8, image: cars8 },
  { id: 9, image: cars9 },
  { id: 10, image: cars10 },
  { id: 11, image: cars11 },
  { id: 12, image: cars12 },
];
